titoluyo/verticalparking/cabina-firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_FREERTOS_HZ=1000

# set compiler optimization level to -O2 (compile for performance)
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ESP32-specific
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Common ESP-related
#
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Set esp-timer task stack size to 6KB
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144

# Partition Table - Enable OTA support
CONFIG_PARTITION_TABLE_TWO_OTA=y
CONFIG_PARTITION_TABLE_SINGLE_APP=n

# Bootloader - Enable app rollback for OTA safety
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# OTA Configuration
CONFIG_EXAMPLE_OTA_VALIDATION_TIMEOUT_SEC=60
CONFIG_EXAMPLE_OTA_SKIP_CERT_VERIFY=n
CONFIG_EXAMPLE_OTA_AUTO_VALIDATE=y
CONFIG_EXAMPLE_OTA_VERSION_PUBLISH_ON_BOOT=y
